IDEA Open Model
ConcreteBlockData.Origin Property
Compatible with IDEA StatiCa 20.1
 Origin of the concrete block LCS
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public Point3D Origin { get; set; }
Public Property Origin As Point3D
	Get
	Set
Property Value
Type: Point3D
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace